cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/versions'

brew 'go'
brew 'node'
brew 'erlang'
brew 'elixir'

brew 'yarn'
brew 'ack'
brew 'imagemagick'
brew 'spaceman-diff'
brew 'openssl'
brew 'unrar'
brew 'wget'
cask 'docker'
# brew 'tmux'
brew 'heroku-toolbelt'
brew 'hub'
brew 'zsh'
brew 'bash'
# brew 'tree'
brew 'zplug'
brew 'cowsay'

# brew 'emacs', args: ['with-cocoa', 'with-gnutls']
# cask 'rubymine'
cask 'atom'
cask 'iterm2'
cask 'sublime-text'
# cask 'principle'
cask 'sketch'
cask 'sketch-toolbox'
cask 'sourcetree'
# cask 'github-desktop'
cask 'skyfonts'
# cask 'balsamiq-mockups'
# cask 'adobe-creative-cloud'
cask 'dash'
# cask 'lingo'

cask 'robo-3t'
cask 'sequel-pro'
cask 'pgadmin3'
cask 'keycastr'
# cask '1password'
cask 'slack'
cask 'discord'
# cask 'gitter'
# cask 'hipchat'
cask 'skype'
# cask 'steam'
cask 'tunnelbear'
cask 'dropbox'
# cask 'spectacle'
cask 'utorrent'
# cask 'divvy'
cask 'obs'
cask 'paw'
# cask 'flux'
# cask 'screenflow'

cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'
# cask 'firefoxnightly'
# cask 'webkit-nightly'
cask 'chromium'
# cask 'torbrowser'

# Missing Applications

# Radio Silence - https://radiosilenceapp.com/
# Loopback - http://rogueamoeba.com/loopback/
